"""

Задание 3 Калькулятор секунд

Реализовать вывод информации о промежутке времени в зависимости от его
продолжительности duration в секундах:
<d> дн <h> час <m> мин <s> сек.
Примечание! Пользоваться циклами запрещено.
Примеры:

duration = 53
53 сек
duration = 153
2 мин 33 сек
duration = 4153
1 час 9 мин 13 сек
duration = 400153
4 дн 15 час 9 мин 13 сек

"""
print('введите значение duration')
dur = int(input())
if dur < 60:
    print(f"{dur} сек")
elif dur < 3600:
    m = dur // 60
    print(f"{m} мин {dur - m * 60} сек")
elif dur < 86400:
    m = dur // 60
    h = dur // 3600
    m = m - h * 60
    s = dur - h * 3600 - m * 60
    print(f"{h} час {m} мин {s} сек")

else:
    d = dur // 86400
    dur = dur % 86400
    h = dur // 3600
    dur = dur % 3600
    m = dur // 60
    s = dur % 60
    print(f"{d} дн {h} час {m} мин {s} сек")

